aqandu/cc3200-firmware/src/main.c
	// Restart Network processor
	lRetVal = sl_Stop(SL_STOP_TIMEOUT);

	// Reset status bits
	CLR_STATUS_BIT_ALL(g_ulStatus);

	return sl_Start(NULL, NULL, NULL);
}

//****************************************************************************
//
//!    \brief Sets up the device in AP or STA Mode, depending on the presence
//!           and connectivity of stored WLAN profiles and the AP jumper pin.
//!
//! On startup, if the AP jumper pin is present or if no Wireless LAN (WLAN) profiles are present,
//! the station is put into Access Point (AP) mode, allowing the user to set WLAN profiles for
//! the device.
//!
//! Otherwise one or more WLAN profiles are present on the device. In this later case, the
//! station is put into station (STA) mode and connects to the highest signal strength
//! WLAN profile present, falling back to the other WLAN profiles if LAN connectivity to the
//! higher priority profile(s) is not possible. If LAN connectivity cannot be established for
//! any of the saved profiles, then the device is put into AP mode.
//!
//! Once successfully connected to an access point in station mode, if at any point LAN
//! connectivity to the access point is lost, the device trys to connect to the other present
//! WLAN profiles based on their priority.
//!
//! \return  0 - Success
//!         -1 - Failure
//
//****************************************************************************
long ConnectToNetwork() {
	long lRetVal = -1;
	unsigned int uiConnectTimeoutCnt = 0;

	// Start Simplelink
	lRetVal = sl_Start(NULL, NULL, NULL);
	ASSERT_ON_ERROR(lRetVal);

	unsigned char ssid[15] = "airu-3";
	unsigned short ssid_len = strlen((const char *) ssid);
	sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SSID, ssid_len, ssid);

	unsigned char url[32] = "myairu.edu";
	unsigned char url_len = strlen((const char *) url);
	lRetVal = sl_NetAppSet(SL_NET_APP_DEVICE_CONFIG_ID,
			NETAPP_SET_GET_DEV_CONF_OPT_DOMAIN_NAME, url_len,
			(const unsigned char *) url);

	if (g_uiDeviceModeConfig == ROLE_AP) {
		UART_PRINT("Force AP Jumper is Connected.\n\r");

		if (lRetVal != ROLE_AP) {
			// Put the device into AP mode.
			lRetVal = ConfigureMode(ROLE_AP);
			ASSERT_ON_ERROR(lRetVal);
		}

		// Now the device is in AP mode, we need to wait for this event
		// before doing anything
		while (!IS_IP_ACQUIRED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
			_SlNonOsMainLoopTask();
#endif
		}

		// Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		// Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		char ssid[32];
		unsigned short len = 32;
		unsigned short config_opt = WLAN_AP_OPT_SSID;
		sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt, &len, (unsigned char*) ssid);
		UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r", ssid);
	} else {
		if (lRetVal == ROLE_AP) {
			UART_PRINT(
					"Device is in AP Mode and Force AP Jumper is not Connected.\n\r");

			// If the device is in AP mode, we need to wait for this event
			// before doing anything
			while (!IS_IP_ACQUIRED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
				_SlNonOsMainLoopTask();
#endif
			}
		}

		// Switch to STA Mode
		lRetVal = ConfigureMode(ROLE_STA);
		ASSERT_ON_ERROR(lRetVal);

		UART_PRINT("Device has been put into STA Mode.\n\r");

		lRetVal = registerMdnsService();
		ASSERT_ON_ERROR(lRetVal);

		// Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		// Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		// Waiting for the device to Auto Connect
		UART_PRINT("Trying to Auto Connect to Existing Profiles.\n\r");

		while (uiConnectTimeoutCnt < AUTO_CONNECTION_TIMEOUT_COUNT
				&& ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))) {
			// Turn STAT 1 LED On
			GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
			osi_Sleep(50);

			// Turn STAT 1 LED Off
			GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
			osi_Sleep(50);

			uiConnectTimeoutCnt++;
		}

		// Couldn't connect Using Auto Profile
		if (uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT) {
			UART_PRINT("Couldn't connect Using Auto Profile.\n\r");

			// Blink STAT1 LEd to Indicate Connection Error
			GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);

			CLR_STATUS_BIT_ALL(g_ulStatus);

			// Put the station into AP mode
			lRetVal = ConfigureMode(ROLE_AP);
			ASSERT_ON_ERROR(lRetVal);
			UART_PRINT("Device has been put into AP Mode.\n\r");

			// Waiting for the AP to acquire IP address from Internal DHCP Server
			// If the device is in AP mode, we need to wait for this event
			// before doing anything
			while (!IS_IP_ACQUIRED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
				_SlNonOsMainLoopTask();
#endif
			}

			char cCount = 0;

			// Blink LED 3 times to Indicate AP Mode
			for (cCount = 0; cCount < 3; cCount++) {
				// Turn STAT1 LED On
				GPIO_IF_LedOn(MCU_STAT_1_LED_GPIO);
				osi_Sleep(400);

				// Turn STAT1 LED Off
				GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);
				osi_Sleep(400);
			}

			char ssid[32];
			unsigned short len = 32;
			unsigned short config_opt = WLAN_AP_OPT_SSID;
			sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt, &len,
					(unsigned char*) ssid);
			UART_PRINT("\n\r Connect to : \'%s\'\n\r\n\r", ssid);
		}

		// Turn STAT1 LED Off
		GPIO_IF_LedOff(MCU_STAT_1_LED_GPIO);

		g_iInternetAccess = ConnectionTest();

	}

	return SUCCESS;
}

//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration() {
	unsigned int uiGPIOPort;
	unsigned char pucGPIOPin;
	unsigned char ucPinValue;

	// Read GPIO
	GPIO_IF_GetPortNPin(SH_GPIO_3, &uiGPIOPort, &pucGPIOPin);
	ucPinValue = GPIO_IF_Get(SH_GPIO_3, uiGPIOPort, pucGPIOPin);

	// If Connected to VCC, Mode is AP
	if (ucPinValue == 1) {
		// AP Mode
		g_uiDeviceModeConfig = ROLE_AP;

	} else {
		// STA Mode
		g_uiDeviceModeConfig = ROLE_STA;

